IDENTIFICATION DIVISION.
PROGRAM-ID. MALBOL.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE ASSIGN TO "/root/flag.txt"
       ORGANIZATION IS LINE SEQUENTIAL.
    SELECT OUTPUT-FILE ASSIGN TO "/root/flag.txt"
       ORGANIZATION IS BINARY SEQUENTIAL.
    SELECT FIRST-FLAG ASSIGN TO "CSGAMES{F1R5T_7H1NG5_F1R5T}"
       ORGANIZATION IS BINARY SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD INPUT-FILE.
01 INPUT-RECORD PIC X(100).
FD OUTPUT-FILE.
01 OUTPUT-RECORD PIC X(200).
FD FIRST-FLAG.
01 FIRST-FLAG-RECORD PIC X(100).
WORKING-STORAGE SECTION.
01  INPUT-STRING      PIC X(100). 
01  I                 PIC 9(4).
01  ASCII-VALUE       PIC 9(3).
01  TMP1       PIC 9(3).
01  TMP2       PIC 9(3).
01  SHIFT-IN           PIC X(200).
01  SHIFT-IN-LEN        PIC 9(09) BINARY VALUE 200.
01  SHIFT-IN-KEY       PIC X(32) VALUE "e286374bcd860a00003b9fc58b3116e8".
01  SHIFT-IN-KEY-LEN   PIC 9(09) BINARY VALUE 32.
01  SHIFT-IN-KEY-IDX   PIC 9(4).

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    MOVE SPACES TO SHIFT-IN.

    *> Read file to input-string
    OPEN INPUT INPUT-FILE.
    READ INPUT-FILE INTO INPUT-STRING
    END-READ.
    CLOSE INPUT-FILE.

    *> First shift the input string
    MOVE SPACES TO SHIFT-IN.                                                                                                                              
    MOVE 1 TO SHIFT-IN-KEY-IDX.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > FUNCTION LENGTH(FUNCTION TRIM(INPUT-STRING))
        IF SHIFT-IN-KEY-IDX > FUNCTION LENGTH(SHIFT-IN-KEY)
            MOVE 1 TO SHIFT-IN-KEY-IDX
        END-IF
        COMPUTE TMP1 = FUNCTION ORD(SHIFT-IN-KEY(SHIFT-IN-KEY-IDX:1)) - 1
        COMPUTE TMP2 = FUNCTION ORD(SHIFT-IN-KEY(FUNCTION MOD(SHIFT-IN-KEY-IDX + 16, SHIFT-IN-KEY-LEN) + 1:1)) - 1
        COMPUTE ASCII-VALUE = FUNCTION ORD(INPUT-STRING(I:1)) + TMP1 + TMP2
        COMPUTE ASCII-VALUE = FUNCTION MOD(ASCII-VALUE, 256)
        MOVE FUNCTION CHAR(ASCII-VALUE) TO SHIFT-IN(I:1)
        ADD 1 TO SHIFT-IN-KEY-IDX
    END-PERFORM.

    *> DISPLAY "Shift-in: " FUNCTION TRIM(SHIFT-IN).

    OPEN OUTPUT OUTPUT-FILE.
    MOVE FUNCTION TRIM(SHIFT-IN) TO OUTPUT-RECORD
    WRITE OUTPUT-RECORD
    CLOSE OUTPUT-FILE.

    STOP RUN.
